"""Задание 1
Создайте набор классов для эмуляции сценариев работы сервиса для
заказа пиццы в модуле pizzeria.py
Классы должны позволять выполнять следующие сценарии:
1. Отобразить меню пиццерии с рецептами и составом пиццы.
2. Оформить заказ (клиент может заказать более 1 пиццы)
3. Отправка клиенту уведомления о готовности заказа и сроках
доставки
4. Отобразить информацию о заказе с сохранением в файл.
5. Оплатить заказ. Оплата заказа может производиться, как переводом,
так и картой.
6. Необходимо иметь возможность посмотреть количество заказов и
полную выручку за день.
Классы приложения должны быть построены с учетом принципов SOLID"""