"""Задание 1
Создайте класс «Число», которое хранит его значение и информацию о
системе счисления. Создайте несколько экземпляров данного класса.
Задание 2
Создайте класс «Калькулятор СС». В классе должна быть реализована
следующая функциональность:
– Перевод числа в восьмеричную систему счисления.
– Перевод числа в шестнадцатеричную систему счисления.
– Перевод числа в двоичную систему счисления.
– Перевод числа в десятичную систему счисления.
–Сложение двух чисел в разных системах счисления через обычный
арифметический оператор и составное присваивание. Результат сложения
записать в СС левого операнда."""


